test/fixtures/acs/dustatechangecomplete1

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cwmp="urn:dslforum-org:cwmp-1-4" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">API_69412286f02e475b44783c61972f0a91</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <cwmp:DUStateChangeComplete>
      <CommandKey>cmdkey</CommandKey>
      <Results SOAP-ENC:arrayType="cwmp:OpResultStruct[1]">
        <OpResultStruct>
          <UUID>some-uuid</UUID>
          <DeploymentUnitRef>uref</DeploymentUnitRef>
          <Version>v2.1</Version>
          <CurrentState>curState</CurrentState>
          <Resolved>1</Resolved>
          <ExecutionUnitRefList>a,b,c</ExecutionUnitRefList>
          <StartTime>2015-01-19T23:45:12+00:00</StartTime>
          <CompleteTime>2015-01-19T23:55:12+00:00</CompleteTime>
          <Fault>
            <FaultStruct>
              <FaultCode>0</FaultCode>
              <FaultString></FaultString>
            </FaultStruct>
          </Fault>
        </OpResultStruct>
      </Results>
    </cwmp:DUStateChangeComplete>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
